# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Colorize logfiles and command output
brew "grc"
# LLVM's OpenMP runtime library
brew "libomp"
# Platform built on V8 to build network applications
brew "node"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Generate scripting interfaces to C/C++ code
brew "swig"
brew "stow"
brew "fzf"
# Automation tool
cask "bunch"
# App to build and share containerised applications and microservices
cask "docker-desktop"
vscode "anthropic.claude-code"
vscode "arthurwang.vsc-prolog"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fabricelallemand.run-python-file"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mcagampan.dark-horizon"
vscode "mechatroner.rainbow-csv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "robbowen.synthwave-vscode"
vscode "rubenverg.bootstrap-product-icons"
vscode "sdras.night-owl"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "zhuangtongfa.material-theme"
